{
  "-sn":                        "Ping Taraması: Ağdaki canlı cihazları ICMP echo ile tespit eder.",
  "-sT":                        "TCP Connect Tarama: Tam TCP el sıkışması yaparak port durumunu kontrol eder.",
  "-sS":                        "SYN Tarama: Yarı-açık (half-open) tarama yöntemiyle daha gizli tarama yapar.",
  "-O":                         "OS Tespiti: TCP/IP yığını üzerinden hedef işletim sistemini tahmin eder.",
  "-sV":                        "Servis Versiyon Tespiti: Açık portlardaki servislerin sürümünü raporlar.",
  "--script vuln":              "Vuln Script Taraması: Nmap Scripting Engine ile bilinen zafiyetleri tarar.",
  "-sS -sV -O --script vuln":   "Hepsi Bir Arada: SYN tarama, sürüm tespiti, OS tespiti ve vuln script’leri.",
  "-6 -sn":                     "IPv6 Ping Taraması: IPv6 adreslerindeki canlı cihazları ICMPv6 ile tespit eder.",
  "-sn -T0":                    "Ping Paranoid Modu: Çok yavaş tarama ile tespit edilmeyi zorlaştırır.",
  "-sn -T1":                    "Ping Sneaky Modu: Az yavaş tarama ile firewall’lardan kaçınmayı dener.",
  "-sn -T2":                    "Ping Polite Modu: Orta hızda tarama, ağ yükünü dengeler.",
  "-sn -T3":                    "Ping Normal Modu: Standart hızda tarama yapar.",
  "-sn -T4":                    "Ping Aggressive Modu: Hızlı tarama, daha fazla yük üretir.",
  "-sn -T5":                    "Ping Insane Modu: Çok hızlı tarama, tespit edilme riski yüksek.",
  "-oX openvas.xml":            "OpenVAS Export: Nmap çıktısını XML olarak kaydeder (import için).",
  "--script http-fetch":        "Cloud Metadata Sorgusu: Bulut sunucuların metadata endpoint’ini inceler.",
  "-p 1900,5683":               "IoT Tarama: UPnP (1900/udp) ve CoAP (5683/udp) portlarını kontrol eder.",
  "--script http-enum":         "Web Enum: HTTP dizin ve dosya listelemesi yapar.",
  "-sI ::1":                    "Idle Scan (Stealth): 'Zombi' host kullanarak gizli port taraması yapar.",
  "-oX scan.xml":               "XML Görüntüleme: Nmap çıktısını XML'e dönüştürür.",
  "--script http-waf-fingerprint": "WAF Tespiti: Web Application Firewall varlığını algılar.",
  "ANOMALY":                    "Anomali Tespit: İki tarama sonucu karşılaştırılır, yeni portlar işaretlenir.",
  "THREAT_INTEL":               "Tehdit İstihbaratı: Açık portlara karşılık gelen MITRE TTP’lerini özetler."
}
